IDEA Open Model
PlateElements Class
Compatible with IDEA StatiCa Beta 20.0
 Data of plate elements
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.PlateElements
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class PlateElements
<SerializableAttribute>
Public Class PlateElements
The PlateElements type exposes the following members.
Constructors
Name | Description
PlateElements()
 Constructor
PlateElements(Int32)
 Constructor
Top
Properties
Name | Description
Elements
 List of fem elements for plate UID
PlateType
 Type plate elements
PlateUID
 Plate UID
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace